package lec5_kjs;
//Java: знакомство и как пользоваться базовым API (лекции)
//Урок 4. Хранение и обработка данных ч1: приоритетные коллекции
// План урока :
// - Разобраться, зачем нужно столько коллекций и JCF
// - LinkedList и особенности работы с ним
// - Узнать о списках, как об абстрактной структуре
// - Проблемы работы со списками и массивами
// - Построение разных Queue и как в этом помогает JCF
// - Deque и логика использования этой коллекции
// - То, что мертво, умереть не может – Stack в контексте JCF
public class Program {
    public static void main(String[] args) {
        
    }
}
